Repository: ABGitRu/FetchTheDog
Catalog: FetchTheDog/*.lproj/Localizable.strings
Languages: ru

# Onboarding.FirstPage.Welcome
source: Hello, welcome to the app that fetches photos of random dogs everytime you want
ru: Привет! Добро пожаловать в приложение которое загружает фотографии случайных собак каждый раз, когда вы этого хотите

# Onboarding.SecondPage.About
source: Our app has a login form, when you login first, there will no any need to do that again
ru: В нашем приложении есть форма входа в систему, когда вы сначала войдете в систему, вам не нужно будет делать это снова.

# Onboarding.ThirdPage.LetsDive
source: Without further ado, let's dive in!
ru: Без лишних слов, давайте погружаться!

# Onboarding.ThirdPage.loginFormButton
source: Log in Form
ru: Вход в систему

# Login.LoginTextfield
source: Enter your login
ru: Введите ваш логин

# Login.PasswordTextField
source: Enter your password
ru: Введите ваш пароль

# Login.LoginButton
source: Log in
ru: Войти

# Login.RegisterButton
source: Register
ru: Зарегистрироваться

# Login.RegistrationSuccessAlertTitle
source: Registration complete
ru: Регистрация завершена

# Login.RegistrationSuccessAlertMessage
source: You can use your login and password to enter the app
ru: Вы можете использовать свой логин и пароль чтобы войти

# Login.RegistrationSuccessAlertButtonTitle
source: Ok
ru: Хорошо

# Login.RegistrationFailAlertTitle
source: Registration failed
ru: Регистрация не успешна

# Login.RegistrationFailAlertMessage
source: Please try again, your login and password must contain more than 4 characters
ru: Пожалуйста попробуйте еще раз, ваш логин и пароль должен содержать больше 4 символов

# Login.RegistrationFailAlertButtonTitle
source: Try again
ru: Попробовать еще раз

# Login.LoginFailAlertTitle
source: Wrong login or password
ru: Неверное имя или пароль

# Login.LoginFailAlertMessage
source: Try again, or register instead of that
ru: Попробуйте заново или зарегистрируйтесь заново

# Login.LoginFailAlertButtonTitle
source: Try again
ru: Попробовать еще раз

# DogFetcher.FetchDogButtonTitle
source: Fetch the dog image
ru: Скачать картинку собаки

# DogFetcher.FetchFailureAlertButtonTittle
source: Ok
ru: Ок

# DogFetcher.FetchFailureAlert.NoImageDataTitle
source: No image
ru: Нет картинки

# DogFetcher.FetchFailureAlert.NoImageDataMessage
source: Please try again and load new image
ru: Пожалуйста попробуйте еще раз загрузить картинку

# DogFetcher.FetchFailureAlert.СanNotCreateURLTitle
source: URL is Broken
ru: Ссылка сломана

# DogFetcher.FetchFailureAlert.СanNotCreateURLMessage
source: It seems that the link no longer exists
ru: Кажется что ссылка больше не существует

# DogFetcher.FetchFailureAlert.NoDogsDataTitle
source: The dogs data is broken
ru: Данные о собаках сломаны

# DogFetcher.FetchFailureAlert.NoDogsDataMessage
source: It seems that the data is missed or broken
ru: Кажется, что данные потеряны или сломаны
